In [5]:
import psycopg2 as ps
import pandas as pd

In [13]:
conn = ps.connect(host="10.8.5.1",
                  port = 5432, database="demo", 
                  user="postgres", 
                  password="0C7yiqTU")
conn

In [14]:
df_flights = pd.read_sql("select * from bookings.V_bookings", con=conn)
df_flights

        ticket_no  flight_id fare_conditions   amount
0   0005432000987      28935         Economy   6200.0
1   0005432000988      28935         Economy   6200.0
2   0005432000989      28939         Economy   6200.0
3   0005432000992      28913         Economy   6200.0
4   0005432000993      28913         Economy   6200.0
..            ...        ...             ...      ...
95  0005432002047       8123         Economy   6700.0
96  0005432002047      28995         Economy  10900.0
97  0005432002048       8068         Economy   6700.0
98  0005432002048      28968         Economy  10900.0
99  0005432002049      28968         Economy  10900.0

[100 rows x 4 columns]